Deep-Learning/NVIDIA-Dynamo-Agentic-Inference/data/benchmark_32b_C6_pd.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='0.0.0.0', port=8000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='QWEN32B', served_model_name=None, tokenizer='/root/models/Qwen2.5-32B-Instruct', num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=256, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=10.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)
Waiting up to 60s for http://0.0.0.0:8000/v1/models to become ready...
Server ready in 0.0s.
Fail to load tokenizer config with error=QWEN32B is not a local folder and is not a valid model identifier listed on 'https://huggingface.co/models'
If this is a private repository, make sure to pass a token having permission to this repo either by logging in with `hf auth login` or by passing `token=<your_token>`

WARNING It is recommended to use the `Chat` or `Instruct` model for benchmarking.
Because when the tokenizer counts the output tokens, if there is gibberish, it might count incorrectly.

Namespace(backend='sglang-oai-chat', base_url=None, host='0.0.0.0', port=8000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', model='QWEN32B', served_model_name=None, tokenizer='/root/models/Qwen2.5-32B-Instruct', num_prompts=100, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=256, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=10.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None, header=None)

#Input tokens: 50561
#Output tokens: 12508
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 100/100 [00:15<00:00,  6.64it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    10.0      
Max request concurrency:                 not set   
Successful requests:                     100       
Benchmark duration (s):                  15.07     
Total input tokens:                      50561     
Total input text tokens:                 50561     
Total generated tokens:                  12508     
Total generated tokens (retokenized):    1067110   
Request throughput (req/s):              6.64      
Input token throughput (tok/s):          3355.35   
Output token throughput (tok/s):         830.06    
Peak output token throughput (tok/s):    1512.00   
Peak concurrent requests:                49        
Total token throughput (tok/s):          4185.41   
Concurrency:                             23.62     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   3558.81   
Median E2E Latency (ms):                 3575.77   
P90 E2E Latency (ms):                    6131.19   
P99 E2E Latency (ms):                    7195.90   
---------------Time to First Token----------------
Mean TTFT (ms):                          355.20    
Median TTFT (ms):                        296.87    
P99 TTFT (ms):                           738.53    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          26.26     
Median TPOT (ms):                        26.10     
P99 TPOT (ms):                           32.64     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           25.81     
Median ITL (ms):                         25.50     
P95 ITL (ms):                            28.60     
P99 ITL (ms):                            31.00     
Max ITL (ms):                            85.32     
==================================================